# // 04.CharacterOautput : 매우 쉬운문제

# // https://school.programmers.co.kr/learn/courses/30/lessons/340207?language=python3
# // [PCCE 기출문제] 1번 / 문자 출력
# // 문제 설명
# // 주어진 코드는 변수에 데이터를 저장하고 출력하는 코드입니다. 아래와 같이 출력되도록 빈칸을 채워 코드를 완성해 주세요.

# // 출력 예시
# // 3
# // 2
# // 1
# // Let's go!

# // solution.cpp
# // 빈칸 채우기 문제 안내
# // 빈칸 채우기는 이미 완성된 코드 중 빈칸에 알맞은 코드를 입력하는 문제 타입입니다.
# // 빈칸을 제외한 기본 코드는 수정할 수 없습니다.
# // 빈칸을 채우지 않을 경우, 실행 결과에 에러 메시지가 표시됩니다.

# // 파이썬으로 풀 때

# // message = "________"

# // print("3________2________1")
# // print(message)
